app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.paginate(:page => params[:page])